src/app/controllers/home_controller.rb

  def index
      # @products = Product.all
    @products = Product.paginate(page: params[:page], per_page: 3)
---
SELECT "products".* FROM "products" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"