src/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user = current_user

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "jhgj"], ["description", "kjhkjhkh"], ["user_id", 1], ["category_id", 1], ["created_at", "2021-07-31 16:25:09.228001"], ["updated_at", "2021-07-31 16:25:09.228001"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "user_id" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["user_id", 1], ["updated_at", "2021-07-31 16:32:31.711187"], ["id", 4]]